name: "complexity_router_ensemble"
platform: "ensemble"
max_batch_size: 8
input [
    {
    name: "INPUT"
    data_type: TYPE_STRING
    dims: [ 1 ]
    }
]
output [
    {
    name: "OUTPUT"
    data_type: TYPE_FP32
    dims: [ -1 ] 
    }
]
ensemble_scheduling {
    step [
        {
            model_name: "preprocessing_complexity_router"
            model_version: -1
            input_map {
                key: "INPUT"
                value: "INPUT"
                }
            output_map {
                key: "preprocessed_input_ids"
                value: "preprocessed_input_ids"
                }
            output_map {
                key: "preprocessed_attention_mask"
                value: "preprocessed_attention_mask"
                }
        },
        {
            model_name: "complexity_router"
            model_version: -1
            input_map {
                key: "preprocessed_input_ids"
                value: "preprocessed_input_ids"
                }
            input_map {
                key: "preprocessed_attention_mask"
                value: "preprocessed_attention_mask"
                }
            output_map {
                key: "logits"
                value: "logits"
                }
        },
        {
            model_name: "postprocessing_complexity_router"
            model_version: -1
            input_map {
                key: "logits"
                value: "logits"
                }
            output_map {
                key: "OUTPUT"
                value: "OUTPUT"
                }
        }
    ]
}