name: "postprocessing_task_router"
backend: "python"
max_batch_size: 8

input [
    {
    name: "logits"
    data_type: TYPE_FP32
    dims: [-1]
    }
]

output [
    {
    name: "OUTPUT"
    data_type: TYPE_FP32
    dims: [ -1 ]
    }
]

instance_group [
    {
    kind: KIND_CPU
    }
]
