name: "preprocessing_intent_router"
backend: "python"
max_batch_size: 8
input [
  {
    name: "INPUT"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
output [
  {
    name: "preprocessed_input_ids"
    data_type: TYPE_INT64
    dims: [ 512 ]
  },
  {
    name: "preprocessed_attention_mask"
    data_type: TYPE_INT64
    dims: [ 512 ]
  }
]
